In [93]:
import pandas as pd

In [94]:
data = {"x1": [1.0, 2.0, 4.0, 5.0], "x2": [2.0, 3.0, 5.0, 7.0], "y": [1, 0, 1, 0], "d": ["1980-10-20", "1980-10-21", "1980-10-22", "1980-10-23"]}

In [95]:
df = pd.DataFrame(data)

In [96]:
df

    x1   x2  y           d
0  1.0  2.0  1  1980-10-20
1  2.0  3.0  0  1980-10-21
2  4.0  5.0  1  1980-10-22
3  5.0  7.0  0  1980-10-23

In [97]:
df['Date'] = pd.to_datetime(df['d'])

In [98]:
df

    x1   x2  y           d       Date
0  1.0  2.0  1  1980-10-20 1980-10-20
1  2.0  3.0  0  1980-10-21 1980-10-21
2  4.0  5.0  1  1980-10-22 1980-10-22
3  5.0  7.0  0  1980-10-23 1980-10-23

In [99]:
from bigdl.chronos.data import TSDataset

In [100]:
dataset = TSDataset.from_pandas(df, dt_col='Date', target_col='y', extra_feature_col=["x1", "x2"])

In [101]:
dataset.df

    x1   x2  y           d       Date id
0  1.0  2.0  1  1980-10-20 1980-10-20  0
1  2.0  3.0  0  1980-10-21 1980-10-21  0
2  4.0  5.0  1  1980-10-22 1980-10-22  0
3  5.0  7.0  0  1980-10-23 1980-10-23  0

In [102]:
lookback, horizon = 1, 1

In [103]:
dataset.deduplicate() \
    .roll(lookback=lookback, horizon=horizon)

In [104]:
dataset.df

    x1   x2  y           d       Date id
0  1.0  2.0  1  1980-10-20 1980-10-20  0
1  2.0  3.0  0  1980-10-21 1980-10-21  0
2  4.0  5.0  1  1980-10-22 1980-10-22  0
3  5.0  7.0  0  1980-10-23 1980-10-23  0

In [105]:
x, y = dataset.to_numpy()

In [106]:
x

array([[[1., 1., 2.]],

       [[0., 2., 3.]],

       [[1., 4., 5.]]], dtype=float32)

In [107]:
y

array([[[0.]],

       [[1.]],

       [[0.]]], dtype=float32)